Repository: starcat-app/Starcat
Catalog: Starcat/Resources/Localizable.xcstrings
Source language: en
Languages: ar, de, es, fr, id, it, ja, ko, nl, pl, pt_br, ru, tr, uk, vi, zh_hans, zh_hant

# rag.core.attachment.error.fileTooLargeFormat
source: Attachment is too large: %@
ar: المرفق كبير جدًا: %@
de: Anhang ist zu groß: %@
es: El archivo adjunto es demasiado grande: %@
fr: La pièce jointe est trop volumineuse : %@
id: Lampiran terlalu besar: %@
it: Allegato troppo grande: %@
ja: 添付ファイルが大きすぎます: %@
ko: 첨부 파일이 너무 큽니다: %@
nl: Bijlage is te groot: %@
pl: Załącznik jest zbyt duży: %@
pt_br: O anexo é muito grande: %@
ru: Вложение слишком большое: %@
tr: Ek çok büyük: %@
uk: Вкладення занадто велике: %@
vi: Tệp đính kèm quá lớn: %@
zh_hans: 附件过大：%@
zh_hant: 附件過大：%@

# rag.core.attachment.error.tooManyFiles
source: You can attach up to 5 files at a time
ar: يمكنك إرفاق ما يصل إلى 5 ملفات في المرة الواحدة
de: Sie können maximal 5 Dateien gleichzeitig anhängen
es: Puedes adjuntar hasta 5 archivos a la vez
fr: Vous pouvez joindre jusqu'à 5 fichiers à la fois
id: Anda dapat melampirkan hingga 5 file sekaligus
it: Puoi allegare fino a 5 file alla volta
ja: 一度に添付できるファイルは最大5つまでです
ko: 한 번에 최대 5개의 파일을 첨부할 수 있습니다
nl: U kunt maximaal 5 bestanden tegelijk bijvoegen
pl: Można dołączyć maksymalnie 5 plików jednocześnie
pt_br: Você pode anexar até 5 arquivos por vez
ru: Можно прикрепить не более 5 файлов за раз
tr: Aynı anda en fazla 5 dosya ekleyebilirsiniz
uk: Можна прикріпити не більше 5 файлів одночасно
vi: Bạn có thể đính kèm tối đa 5 tệp cùng lúc
zh_hans: 单次最多添加 5 个附件
zh_hant: 單次最多新增 5 個附件

# rag.core.attachment.error.totalTooLarge
source: The total attachment size exceeds 20 MB
ar: الحجم الإجمالي للمرفقات يتجاوز 20 ميغابايت
de: Die Gesamtgröße der Anhänge überschreitet 20 MB
es: El tamaño total de los archivos adjuntos supera los 20 MB
fr: La taille totale des pièces jointes dépasse 20 Mo
id: Total ukuran lampiran melebihi 20 MB
it: La dimensione totale degli allegati supera i 20 MB
ja: 添付ファイルの合計サイズが20 MBを超えています
ko: 전체 첨부 파일 크기가 20MB를 초과합니다
nl: De totale bijlagegrootte overschrijdt 20 MB
pl: Łączny rozmiar załączników przekracza 20 MB
pt_br: O tamanho total dos anexos excede 20 MB
ru: Общий размер вложений превышает 20 МБ
tr: Toplam ek boyutu 20 MB'ı aşıyor
uk: Загальний розмір вкладень перевищує 20 МБ
vi: Tổng kích thước tệp đính kèm vượt quá 20 MB
zh_hans: 附件总大小超过 20 MB
zh_hant: 附件總大小超過 20 MB

# rag.core.attachment.error.unreadableFormat
source: Unable to read attachment: %@
ar: تعذر قراءة المرفق: %@
de: Anhang kann nicht gelesen werden: %@
es: No se puede leer el archivo adjunto: %@
fr: Impossible de lire la pièce jointe : %@
id: Tidak dapat membaca lampiran: %@
it: Impossibile leggere l'allegato: %@
ja: 添付ファイルを読み取れません: %@
ko: 첨부 파일을 읽을 수 없습니다: %@
nl: Kan bijlage niet lezen: %@
pl: Nie można odczytać załącznika: %@
pt_br: Não foi possível ler o anexo: %@
ru: Не удалось прочитать вложение: %@
tr: Ek okunamıyor: %@
uk: Не вдалося прочитати вкладення: %@
vi: Không thể đọc tệp đính kèm: %@
zh_hans: 无法读取附件：%@
zh_hant: 無法讀取附件：%@

# rag.core.attachment.error.unsupportedFormat
source: Unsupported attachment type: %@
ar: نوع المرفق غير مدعوم: %@
de: Nicht unterstützter Anhangstyp: %@
es: Tipo de archivo adjunto no compatible: %@
fr: Type de pièce jointe non pris en charge : %@
id: Jenis lampiran tidak didukung: %@
it: Tipo di allegato non supportato: %@
ja: サポートされていない添付ファイルタイプ: %@
ko: 지원되지 않는 첨부 파일 형식: %@
nl: Niet-ondersteund bijlagetype: %@
pl: Nieobsługiwany typ załącznika: %@
pt_br: Tipo de anexo não suportado: %@
ru: Неподдерживаемый тип вложения: %@
tr: Desteklenmeyen ek türü: %@
uk: Непідтримуваний тип вкладення: %@
vi: Loại tệp đính kèm không được hỗ trợ: %@
zh_hans: 暂不支持该附件类型：%@
zh_hant: 暫不支援該附件類型：%@

# rag.core.backend.error.cohereModelEmpty
source: The Cohere-compatible Rerank model cannot be empty
ar: لا يمكن أن يكون نموذج إعادة الترتيب المتوافق مع Cohere فارغًا
de: Das Cohere-kompatible Rerank-Modell darf nicht leer sein
es: El modelo de reranking compatible con Cohere no puede estar vacío
fr: Le modèle de reclassement compatible Cohere ne peut pas être vide
id: Model Rerank yang kompatibel dengan Cohere tidak boleh kosong
it: Il modello Rerank compatibile con Cohere non può essere vuoto
ja: Cohere互換のRerankモデルは空にできません
ko: Cohere 호환 Rerank 모델은 비워둘 수 없습니다
nl: Het Cohere-compatibele Rerank-model mag niet leeg zijn
pl: Model rerankowania zgodny z Cohere nie może być pusty
pt_br: O modelo de Reclassificação compatível com Cohere não pode estar vazio
ru: Модель Rerank, совместимая с Cohere, не может быть пустой
tr: Cohere uyumlu Yeniden Sıralama modeli boş olamaz
uk: Модель Rerank, сумісна з Cohere, не може бути порожньою
vi: Mô hình Rerank tương thích Cohere không thể để trống
zh_hans: Cohere-compatible Rerank 模型不能为空
zh_hant: Cohere-compatible Rerank 模型不能為空

# rag.core.backend.error.invalidResponseFormat
source: %@ returned an unreadable response
ar: أعاد %@ استجابة غير قابلة للقراءة
de: %@ hat eine unlesbare Antwort zurückgegeben
es: %@ devolvió una respuesta ilegible
fr: %@ a renvoyé une réponse illisible
id: %@ mengembalikan respons yang tidak dapat dibaca
it: %@ ha restituito una risposta illeggibile
ja: %@ が読み取り不可能なレスポンスを返しました
ko: %@에서 읽을 수 없는 응답을 반환했습니다
nl: %@ retourneerde een onleesbaar antwoord
pl: %@ zwróciło nieczytelną odpowiedź
pt_br: %@ retornou uma resposta ilegível
ru: %@ вернул нечитаемый ответ
tr: %@ okunamayan bir yanıt döndürdü
uk: %@ повернув нечитабельну відповідь
vi: %@ trả về phản hồi không đọc được
zh_hans: %@ 返回了无法解析的数据
zh_hant: %@ 傳回了無法解析的資料

# rag.core.backend.error.meilisearchEndpoint
source: Invalid Meilisearch endpoint
ar: نقطة نهاية Meilisearch غير صالحة
de: Ungültiger Meilisearch-Endpunkt
es: Punto de conexión de Meilisearch no válido
fr: Point de terminaison Meilisearch invalide
id: Endpoint Meilisearch tidak valid
it: Endpoint Meilisearch non valido
ja: 無効な Meilisearch エンドポイント
ko: 잘못된 Meilisearch 엔드포인트
nl: Ongeldig Meilisearch-eindpunt
pl: Nieprawidłowy punkt końcowy Meilisearch
pt_br: Endpoint Meilisearch inválido
ru: Некорректная конечная точка Meilisearch
tr: Geçersiz Meilisearch uç noktası
uk: Недійсна кінцева точка Meilisearch
vi: Điểm cuối Meilisearch không hợp lệ
zh_hans: Meilisearch endpoint 无效
zh_hant: Meilisearch endpoint 無效

# rag.core.backend.error.meilisearchIndex
source: The Meilisearch index can contain only letters, numbers, - and _
ar: يمكن أن يحتوي فهرس Meilisearch على أحرف وأرقام و - و _ فقط
de: Der Meilisearch-Index darf nur Buchstaben, Zahlen, - und _ enthalten
es: El índice de Meilisearch solo puede contener letras, números, - y _
fr: L'index Meilisearch ne peut contenir que des lettres, chiffres, - et _
id: Indeks Meilisearch hanya boleh berisi huruf, angka, -, dan _
it: L'indice Meilisearch può contenere solo lettere, numeri, - e _
ja: Meilisearch インデックスには英数字、-、_ のみ使用できます
ko: Meilisearch 인덱스는 문자, 숫자, - 및 _만 포함할 수 있습니다
nl: De Meilisearch-index mag alleen letters, cijfers, - en _ bevatten
pl: Indeks Meilisearch może zawierać tylko litery, cyfry, - i _
pt_br: O índice Meilisearch pode conter apenas letras, números, - e _
ru: Индекс Meilisearch может содержать только буквы, цифры, - и _
tr: Meilisearch dizini yalnızca harf, rakam, - ve _ içerebilir
uk: Індекс Meilisearch може містити лише літери, цифри, - та _
vi: Chỉ mục Meilisearch chỉ có thể chứa chữ cái, số, - và _
zh_hans: Meilisearch index 只能包含字母、数字、- 和 _
zh_hant: Meilisearch index 只能包含字母、數字、- 和 _

# rag.core.backend.error.meilisearchURL
source: Invalid Meilisearch URL
ar: عنوان URL لـ Meilisearch غير صالح
de: Ungültige Meilisearch-URL
es: URL de Meilisearch no válida
fr: URL Meilisearch invalide
id: URL Meilisearch tidak valid
it: URL Meilisearch non valido
ja: 無効な Meilisearch URL
ko: 잘못된 Meilisearch URL
nl: Ongeldige Meilisearch-URL
pl: Nieprawidłowy URL Meilisearch
pt_br: URL Meilisearch inválida
ru: Некорректный URL Meilisearch
tr: Geçersiz Meilisearch URL'si
uk: Недійсний URL Meilisearch
vi: URL Meilisearch không hợp lệ
zh_hans: Meilisearch URL 无效
zh_hant: Meilisearch URL 無效

# rag.core.backend.error.operationFailedFormat
source: %@ operation failed: %@
ar: فشلت عملية %@: %@
de: %@-Vorgang fehlgeschlagen: %@
es: La operación %@ falló: %@
fr: L'opération %@ a échoué : %@
id: Operasi %@ gagal: %@
it: Operazione %@ non riuscita: %@
ja: %@ 操作に失敗しました: %@
ko: %@ 작업 실패: %@
nl: %@-bewerking mislukt: %@
pl: Operacja %@ nie powiodła się: %@
pt_br: A operação %@ falhou: %@
ru: Операция %@ не удалась: %@
tr: %@ işlemi başarısız oldu: %@
uk: Операція %@ не вдалася: %@
vi: Thao tác %@ thất bại: %@
zh_hans: %@ 操作失败：%@
zh_hant: %@ 操作失敗：%@

# rag.core.backend.error.qdrantCollection
source: The Qdrant collection can contain only letters, numbers, - and _
ar: يمكن أن تحتوي مجموعة Qdrant على أحرف وأرقام و - و _ فقط
de: Die Qdrant-Sammlung darf nur Buchstaben, Zahlen, - und _ enthalten
es: La colección de Qdrant solo puede contener letras, números, - y _
fr: La collection Qdrant ne peut contenir que des lettres, chiffres, - et _
id: Koleksi Qdrant hanya boleh berisi huruf, angka, -, dan _
it: La collezione Qdrant può contenere solo lettere, numeri, - e _
ja: Qdrant コレクションには英数字、-、_ のみ使用できます
ko: Qdrant 컬렉션은 문자, 숫자, - 및 _만 포함할 수 있습니다
nl: De Qdrant-collectie mag alleen letters, cijfers, - en _ bevatten
pl: Kolekcja Qdrant może zawierać tylko litery, cyfry, - i _
pt_br: A coleção Qdrant pode conter apenas letras, números, - e _
ru: Коллекция Qdrant может содержать только буквы, цифры, - и _
tr: Qdrant koleksiyonu yalnızca harf, rakam, - ve _ içerebilir
uk: Колекція Qdrant може містити лише літери, цифри, - та _
vi: Bộ sưu tập Qdrant chỉ có thể chứa chữ cái, số, - và _
zh_hans: Qdrant collection 只能包含字母、数字、- 和 _
zh_hant: Qdrant collection 只能包含字母、數字、- 和 _

# rag.core.backend.error.qdrantDimensionMismatchFormat
source: Qdrant vector dimension mismatch: collection=%@, current model=%d
ar: عدم تطابق أبعاد متجه Qdrant: المجموعة=%@، النموذج الحالي=%d
de: Qdrant-Vektordimension stimmt nicht überein: Sammlung=%@, aktuelles Modell=%d
es: Discrepancia en la dimensión del vector de Qdrant: colección=%@, modelo actual=%d
fr: Incompatibilité de dimension vectorielle Qdrant : collection=%@, modèle actuel=%d
id: Ketidakcocokan dimensi vektor Qdrant: koleksi=%@, model saat ini=%d
it: Mancata corrispondenza della dimensione del vettore Qdrant: collezione=%@, modello corrente=%d
ja: Qdrant ベクトル次元の不一致: コレクション=%@、現在のモデル=%d
ko: Qdrant 벡터 차원 불일치: 컬렉션=%@, 현재 모델=%d
nl: Qdrant-vectordimensie komt niet overeen: collectie=%@, huidig model=%d
pl: Niezgodność wymiarów wektora Qdrant: kolekcja=%@, bieżący model=%d
pt_br: Incompatibilidade de dimensão vetorial Qdrant: coleção=%@, modelo atual=%d
ru: Несоответствие размерности вектора Qdrant: коллекция=%@, текущая модель=%d
tr: Qdrant vektör boyut uyuşmazlığı: koleksiyon=%@, mevcut model=%d
uk: Невідповідність розмірності векторів Qdrant: колекція=%@, поточна модель=%d
vi: Kích thước vector Qdrant không khớp: bộ sưu tập=%@, mô hình hiện tại=%d
zh_hans: Qdrant 向量维度不匹配：collection=%@，当前模型=%d
zh_hant: Qdrant 向量維度不匹配：collection=%@，當前模型=%d

# rag.core.backend.error.qdrantEndpoint
source: Invalid Qdrant endpoint
ar: نقطة نهاية Qdrant غير صالحة
de: Ungültiger Qdrant-Endpunkt
es: Punto de conexión de Qdrant no válido
fr: Point de terminaison Qdrant invalide
id: Endpoint Qdrant tidak valid
it: Endpoint Qdrant non valido
ja: 無効な Qdrant エンドポイント
ko: 잘못된 Qdrant 엔드포인트
nl: Ongeldig Qdrant-eindpunt
pl: Nieprawidłowy punkt końcowy Qdrant
pt_br: Endpoint Qdrant inválido
ru: Некорректная конечная точка Qdrant
tr: Geçersiz Qdrant uç noktası
uk: Недійсна кінцева точка Qdrant
vi: Điểm cuối Qdrant không hợp lệ
zh_hans: Qdrant endpoint 无效
zh_hant: Qdrant endpoint 無效

# rag.core.backend.error.qdrantURL
source: Invalid Qdrant URL
ar: عنوان URL لـ Qdrant غير صالح
de: Ungültige Qdrant-URL
es: URL de Qdrant no válida
fr: URL Qdrant invalide
id: URL Qdrant tidak valid
it: URL Qdrant non valido
ja: 無効な Qdrant URL
ko: 잘못된 Qdrant URL
nl: Ongeldige Qdrant-URL
pl: Nieprawidłowy URL Qdrant
pt_br: URL Qdrant inválida
ru: Некорректный URL Qdrant
tr: Geçersiz Qdrant URL'si
uk: Недійсний URL Qdrant
vi: URL Qdrant không hợp lệ
zh_hans: Qdrant URL 无效
zh_hant: Qdrant URL 無效

# rag.core.backend.error.qdrantVectorMissingFormat
source: The Qdrant collection does not contain the named vector %@
ar: لا تحتوي مجموعة Qdrant على المتجه المسمى %@
de: Die Qdrant-Sammlung enthält den benannten Vektor %@ nicht
es: La colección de Qdrant no contiene el vector nombrado %@
fr: La collection Qdrant ne contient pas le vecteur nommé %@
id: Koleksi Qdrant tidak mengandung vektor bernama %@
it: La collezione Qdrant non contiene il vettore denominato %@
ja: Qdrant コレクションに名前付きベクトル %@ が含まれていません
ko: Qdrant 컬렉션에 명명된 벡터 %@가 없습니다
nl: De Qdrant-collectie bevat de benoemde vector %@ niet
pl: Kolekcja Qdrant nie zawiera nazwanego wektora %@
pt_br: A coleção Qdrant não contém o vetor nomeado %@
ru: Коллекция Qdrant не содержит именованный вектор %@
tr: Qdrant koleksiyonu %@ adlı vektörü içermiyor
uk: Колекція Qdrant не містить вектора з назвою %@
vi: Bộ sưu tập Qdrant không chứa vector có tên %@
zh_hans: Qdrant collection 不包含命名向量 %@
zh_hant: Qdrant collection 不包含命名向量 %@

# rag.core.backend.error.qdrantVectorName
source: The Qdrant vector name can contain only letters, numbers, - and _
ar: يمكن أن يحتوي اسم متجه Qdrant على أحرف وأرقام و - و _ فقط
de: Der Qdrant-Vektorname darf nur Buchstaben, Zahlen, - und _ enthalten
es: El nombre del vector de Qdrant solo puede contener letras, números, - y _
fr: Le nom du vecteur Qdrant ne peut contenir que des lettres, chiffres, - et _
id: Nama vektor Qdrant hanya boleh berisi huruf, angka, -, dan _
it: Il nome del vettore Qdrant può contenere solo lettere, numeri, - e _
ja: Qdrant ベクトル名には英数字、-、_ のみ使用できます
ko: Qdrant 벡터 이름은 문자, 숫자, - 및 _만 포함할 수 있습니다
nl: De Qdrant-vectornaam mag alleen letters, cijfers, - en _ bevatten
pl: Nazwa wektora Qdrant może zawierać tylko litery, cyfry, - i _
pt_br: O nome do vetor Qdrant pode conter apenas letras, números, - e _
ru: Имя вектора Qdrant может содержать только буквы, цифры, - и _
tr: Qdrant vektör adı yalnızca harf, rakam, - ve _ içerebilir
uk: Назва вектора Qdrant може містити лише літери, цифри, - та _
vi: Tên vector Qdrant chỉ có thể chứa chữ cái, số, - và _
zh_hans: Qdrant vector name 只能包含字母、数字、- 和 _
zh_hant: Qdrant vector name 只能包含字母、數字、- 和 _

# rag.core.backend.error.rerankEndpoint
source: Invalid Rerank endpoint
ar: نقطة نهاية إعادة الترتيب غير صالحة
de: Ungültiger Rerank-Endpunkt
es: Punto de conexión de reranking no válido
fr: Point de terminaison de reclassement invalide
id: Endpoint Rerank tidak valid
it: Endpoint Rerank non valido
ja: 無効なRerankエンドポイント
ko: 잘못된 Rerank 엔드포인트
nl: Ongeldig Rerank-eindpunt
pl: Nieprawidłowy punkt końcowy rerankowania
pt_br: Endpoint de Reclassificação inválido
ru: Некорректная конечная точка Rerank
tr: Geçersiz Yeniden Sıralama uç noktası
uk: Недійсна кінцева точка Rerank
vi: Điểm cuối Rerank không hợp lệ
zh_hans: Rerank endpoint 无效
zh_hant: Rerank endpoint 无效

# rag.core.backend.error.taskTimeoutFormat
source: Timed out waiting for task %d
ar: انتهت مهلة انتظار المهمة %d
de: Zeitüberschreitung beim Warten auf Aufgabe %d
es: Tiempo de espera agotado esperando la tarea %d
fr: Délai d'attente dépassé pour la tâche %d
id: Waktu tunggu untuk tugas %d habis
it: Timeout in attesa dell'attività %d
ja: タスク %d の待機がタイムアウトしました
ko: 작업 %d 대기 시간 초과
nl: Time-out bij wachten op taak %d
pl: Przekroczono limit czasu oczekiwania na zadanie %d
pt_br: Tempo esgotado aguardando a tarefa %d
ru: Истекло время ожидания задачи %d
tr: %d görevi beklerken zaman aşımına uğradı
uk: Час очікування завдання %d вичерпано
vi: Đã hết thời gian chờ tác vụ %d
zh_hans: task %d 等待超时
zh_hant: task %d 等待超时

# rag.core.plan.debug.requestFailedFormat
source: Query planning LLM request failed (attempt %d): %@
ar: فشل طلب LLM لتخطيط الاستعلام (المحاولة %d): %@
de: Query-Planning-LLM-Anfrage fehlgeschlagen (Versuch %d): %@
es: La solicitud LLM de planificación de consultas falló (intento %d): %@
fr: La requête de planification LLM a échoué (tentative %d) : %@
id: Permintaan LLM perencanaan kueri gagal (percobaan %d): %@
it: Richiesta LLM per la pianificazione delle query non riuscita (tentativo %d): %@
ja: クエリ計画LLMリクエストが失敗しました（試行 %d）: %@
ko: 쿼리 계획 LLM 요청 실패 (시도 %d): %@
nl: Queryplanning LLM-verzoek mislukt (poging %d): %@
pl: Żądanie LLM planowania zapytania nie powiodło się (próba %d): %@
pt_br: Falha na requisição LLM de planejamento de consulta (tentativa %d): %@
ru: Ошибка запроса LLM для планирования запроса (попытка %d): %@
tr: Sorgu planlama LLM isteği başarısız oldu (deneme %d): %@
uk: Помилка запиту LLM для планування запиту (спроба %d): %@
vi: Yêu cầu LLM lập kế hoạch truy vấn thất bại (lần thử %d): %@
zh_hans: 查询规划 LLM 请求失败（attempt %d）：%@
zh_hant: 查询规划 LLM 请求失败（attempt %d）：%@

# rag.core.plan.debug.unparseableFallback
source: Both query planning responses were invalid. Switched to the local semantic fallback.
ar: كانت استجابتا تخطيط الاستعلام غير صالحتين. تم التبديل إلى الاحتياطي الدلالي المحلي.
de: Beide Query-Planning-Antworten waren ungültig. Auf lokalen semantischen Fallback umgeschaltet.
es: Ambas respuestas de planificación de consultas no eran válidas. Se cambió al respaldo semántico local.
fr: Les deux réponses de planification de requête étaient invalides. Passage au repli sémantique local.
id: Kedua respons perencanaan kueri tidak valid. Beralih ke fallback semantik lokal.
it: Entrambe le risposte di pianificazione delle query non erano valide. Passaggio al fallback semantico locale.
ja: 両方のクエリ計画応答が無効でした。ローカルセマンティックフォールバックに切り替えました。
ko: 두 쿼리 계획 응답이 모두 유효하지 않습니다. 로컬 의미론적 대체로 전환했습니다.
nl: Beide queryplanningsantwoorden waren ongeldig. Teruggevallen op de lokale semantische fallback.
pl: Obie odpowiedzi planowania zapytania były nieprawidłowe. Przełączono na lokalne semantyczne rozwiązanie zastępcze.
pt_br: Ambas as respostas de planejamento de consulta eram inválidas. Alternado para o fallback semântico local.
ru: Оба ответа планирования запроса были недействительны. Переключено на локальный семантический запасной вариант.
tr: Her iki sorgu planlama yanıtı da geçersizdi. Yerel anlamsal yedek kullanıma geçildi.
uk: Обидві відповіді планування запиту були недійсними. Переключено на локальний семантичний запасний варіант.
vi: Cả hai phản hồi lập kế hoạch truy vấn đều không hợp lệ. Đã chuyển sang dự phòng ngữ nghĩa cục bộ.
zh_hans: 查询规划两次返回均无法解析，已改用本地 semantic fallback。
zh_hant: 查询规划两次返回均无法解析，已改用本地 semantic fallback。

# rag.core.plan.error.clarificationMissing
source: needs_clarification is missing a follow-up question
ar: يفتقد needs_clarification سؤال متابعة
de: needs_clarification fehlt eine Rückfrage
es: needs_clarification no tiene una pregunta de seguimiento
fr: needs_clarification nécessite une question de suivi
id: needs_clarification tidak memiliki pertanyaan lanjutan
it: needs_clarification manca di una domanda di follow-up
ja: needs_clarificationにフォローアップ質問がありません
ko: needs_clarification에 후속 질문이 없습니다
nl: needs_clarification mist een vervolgvraag
pl: needs_clarification brakuje pytania uzupełniającego
pt_br: needs_clarification está faltando uma pergunta de acompanhamento
ru: needs_clarification не содержит уточняющего вопроса
tr: needs_clarification bir takip sorusu içermiyor
uk: needs_clarification не містить уточнюючого запитання
vi: needs_clarification thiếu câu hỏi tiếp theo
zh_hans: needs_clarification 缺少追问
zh_hant: needs_clarification 缺少追问

# rag.core.plan.error.emptyQuestion
source: Question cannot be empty
ar: لا يمكن أن يكون السؤال فارغًا
de: Frage darf nicht leer sein
es: La pregunta no puede estar vacía
fr: La question ne peut pas être vide
id: Pertanyaan tidak boleh kosong
it: La domanda non può essere vuota
ja: 質問を空にできません
ko: 질문은 비워둘 수 없습니다
nl: Vraag mag niet leeg zijn
pl: Pytanie nie może być puste
pt_br: A pergunta não pode estar vazia
ru: Вопрос не может быть пустым
tr: Soru boş olamaz
uk: Запитання не може бути порожнім
vi: Câu hỏi không thể để trống
zh_hans: 问题不能为空
zh_hant: 问题不能为空

# rag.core.plan.error.invalidFormat
source: Invalid query plan: %@
ar: خطة استعلام غير صالحة: %@
de: Ungültiger Query-Plan: %@
es: Plan de consulta no válido: %@
fr: Plan de requête invalide : %@
id: Rencana kueri tidak valid: %@
it: Piano di query non valido: %@
ja: 無効なクエリ計画: %@
ko: 잘못된 쿼리 계획: %@
nl: Ongeldig queryplan: %@
pl: Nieprawidłowy plan zapytania: %@
pt_br: Plano de consulta inválido: %@
ru: Некорректный план запроса: %@
tr: Geçersiz sorgu planı: %@
uk: Недійсний план запиту: %@
vi: Kế hoạch truy vấn không hợp lệ: %@
zh_hans: 查询计划无效：%@
zh_hant: 查询计划无效：%@

# rag.core.plan.error.inventoryGroupingUnsupported
source: Inventory metrics do not support grouping
ar: مقاييس المخزون لا تدعم التجميع
de: Inventarkennzahlen unterstützen keine Gruppierung
es: Las métricas de inventario no admiten agrupación
fr: Les métriques d'inventaire ne prennent pas en charge le regroupement
id: Metrik inventaris tidak mendukung pengelompokan
it: Le metriche di inventario non supportano il raggruppamento
ja: インベントリメトリクスはグループ化をサポートしていません
ko: 인벤토리 메트릭은 그룹화를 지원하지 않습니다
nl: Inventory-metrieken ondersteunen geen groepering
pl: Metryki inwentarza nie obsługują grupowania
pt_br: Métricas de inventário não suportam agrupamento
ru: Метрики инвентаря не поддерживают группировку
tr: Envanter metrikleri gruplamayı desteklemez
uk: Метрики інвентаризації не підтримують групування
vi: Chỉ số kho không hỗ trợ nhóm
zh_hans: 库存统计不支持分组维度
zh_hant: 库存统计不支持分组维度

# rag.core.plan.error.jsonEncoding
source: JSON encoding failed
ar: فشل ترميز JSON
de: JSON-Kodierung fehlgeschlagen
es: La codificación JSON falló
fr: L'encodage JSON a échoué
id: Encoding JSON gagal
it: Codifica JSON non riuscita
ja: JSONエンコードに失敗しました
ko: JSON 인코딩 실패
nl: JSON-codering mislukt
pl: Kodowanie JSON nie powiodło się
pt_br: Falha na codificação JSON
ru: Ошибка кодирования JSON
tr: JSON kodlaması başarısız oldu
uk: Помилка кодування JSON
vi: Mã hóa JSON thất bại
zh_hans: JSON 编码失败
zh_hant: JSON 编码失败

# rag.core.plan.error.minForksExceedsMax
source: minForks is greater than maxForks
ar: minForks أكبر من maxForks
de: minForks ist größer als maxForks
es: minForks es mayor que maxForks
fr: minForks est supérieur à maxForks
id: minForks lebih besar dari maxForks
it: minForks è maggiore di maxForks
ja: minForksがmaxForksより大きいです
ko: minForks가 maxForks보다 큽니다
nl: minForks is groter dan maxForks
pl: minForks jest większe niż maxForks
pt_br: minForks é maior que maxForks
ru: minForks больше maxForks
tr: minForks, maxForks değerinden büyük
uk: minForks більше ніж maxForks
vi: minForks lớn hơn maxForks
zh_hans: minForks 大于 maxForks
zh_hant: minForks 大于 maxForks

# rag.core.plan.error.minStarsExceedsMax
source: minStars is greater than maxStars
ar: minStars أكبر من maxStars
de: minStars ist größer als maxStars
es: minStars es mayor que maxStars
fr: minStars est supérieur à maxStars
id: minStars lebih besar dari maxStars
it: minStars è maggiore di maxStars
ja: minStarsがmaxStarsより大きいです
ko: minStars가 maxStars보다 큽니다
nl: minStars is groter dan maxStars
pl: minStars jest większe niż maxStars
pt_br: minStars é maior que maxStars
ru: minStars больше maxStars
tr: minStars, maxStars değerinden büyük
uk: minStars більше ніж maxStars
vi: minStars lớn hơn maxStars
zh_hans: minStars 大于 maxStars
zh_hant: minStars 大于 maxStars

# rag.core.plan.error.numericRange
source: Numeric filter is out of range
ar: مرشح رقمي خارج النطاق
de: Numerischer Filter liegt außerhalb des Bereichs
es: El filtro numérico está fuera de rango
fr: Le filtre numérique est hors limites
id: Filter numerik di luar jangkauan
it: Il filtro numerico è fuori intervallo
ja: 数値フィルターが範囲外です
ko: 숫자 필터가 범위를 벗어났습니다
nl: Numeriek filter valt buiten bereik
pl: Filtr numeryczny jest poza zakresem
pt_br: Filtro numérico fora do intervalo
ru: Числовой фильтр выходит за пределы диапазона
tr: Sayısal filtre aralık dışında
uk: Числовий фільтр виходить за межі діапазону
vi: Bộ lọc số nằm ngoài phạm vi
zh_hans: 数值条件超出范围
zh_hant: 数值条件超出范围
